<div id="popup1" class="overlay2">
    <div class="popup">
        <a class="close" href="#">&times;</a>
        <div class="content">
            <div id="shareModalInner" class="modal-inner mt-3">
                <h3 class="modal-title">اشتراک در شبکه های اجتماعی</h3>
                <div class="share-options">
                    <ul class="socials">
                       
                        <li class="social face">
                            <a href="#"
                                title="فیسبوک" target="_blank"><span class="circle">
                                    <svg class="icon icon-facebook" viewBox="0 0 24 24" 0="" 24=""
                                        24""="">
                                        <use xlink:href="#si_facebook">
                                            <path
                                                d="M14.5 7.6h1.8c.7 0 1.3-.6 1.3-1.3V3.6c0-.7-.6-1.3-1.3-1.3H14c-1.5 0-2.8.5-3.7 1.4C9.5 4.7 9 6.1 9 7.6v1.1H7.6c-.7 0-1.3.6-1.3 1.3v3.2c0 .7.6 1.3 1.3 1.3H9v6c0 .7.6 1.3 1.3 1.3h3c.7 0 1.3-.6 1.3-1.3v-6h1.8c.7 0 1.3-.6 1.3-1.3V10c0-.5-.2-.9-.7-1.1-.2-.1-.4-.2-.6-.2h-1.7v-.8c-.2-.2-.2-.3-.2-.3zm1.3-3.4v1.6h-1c-.4 0-1.2 0-1.7.6-.4.5-.5 1.1-.5 1.5v1.6c0 .5.4 1 1 1h2.1v2.1h-2.1c-.5 0-1 .4-1 1v6.3h-1.9v-6.3c0-.5-.4-1-1-1H8.2v-2.1h1.7c.5 0 1-.4 1-1V7.6c0-1.1.3-1.9.9-2.5.6-.6 1.4-.9 2.4-.9h1.6z"
                                                id="si_facebook" data-viewBox="0 0 24 24"></path>
                                        </use>
                                    </svg> </span>
                                <span class="text">فیسبوک</span></a>
                        </li>
                        <li class="social twit">
                            <a href="#"
                                title="تویتتر" target="_blank"><span class="circle">
                                    <svg class="icon icon-twitter" viewBox="0 0 24 24" 0="" 24=""
                                        24""="">
                                        <use xlink:href="#si_twitter">
                                            <g id="si_twitter" data-viewBox="0 0 24 24">
                                                <path
                                                    d="M3.9 8.5zM21 6.6c-.1-.1-.2-.2-.3-.2h-.6l.5-1.3c0-.1 0-.3-.1-.4-.1-.1-.3-.1-.4-.1 0 0-.5.2-1.1.4-.5.2-1 .3-1.3.4-.8-.6-1.7-.9-2.7-.9-.8 0-1.6.2-2.3.7-1.1.7-1.8 1.8-1.8 3.2v.1c-2-.4-3.6-1.4-5-3l-.5-.6c-.1-.1-.2-.2-.4-.2s-.2.1-.3.2l-.3.7c-.4.7-.5 1.4-.5 2.1 0 .3 0 .5.1.8 0 .2 0 .3.1.5-.1.1-.2.2-.2.3V10.2c0 .7.3 1.5.7 2.2.1.1.1.2.2.3v.2l.2.7c.3.9.8 1.6 1.5 2.1-.6.2-1.3.5-2.2.7l-1.1.4c-.1.1-.2.2-.2.4 0 .1.1.3.2.4l1 .6c.4.2 1.8 1 3.3 1.2.8.1 1.6.2 2.3.2 2.4 0 4.9-.6 6.7-2.3 1.9-1.7 2.6-4 2.6-6.4V10.1c0-.3.1-.5.2-.7.2-.3.6-.9 1-1.3.2-.2.3-.5.5-.6l.1-.2v-.1c.1-.3.2-.4.1-.6zm-3.7 3.6v.6c0 2.2-.7 3.9-2 5.1-1.3 1.2-3.2 1.8-5.5 1.8-.7 0-1.4-.1-2.1-.2-.2 0-.4-.1-.6-.1.6-.2 1.3-.5 2.1-.9l1.8-.8c.2-.1.2-.2.2-.4s-.2-.3-.3-.3l-2-.1c-.6 0-1.1-.3-1.5-.6h.1l1.9-.5c.2 0 .3-.2.3-.4s-.1-.3-.3-.4l-1.9-.5c-.8-.2-1.2-.7-1.5-1 0 0 0-.1-.1-.1H6l1.7.2c.2 0 .3-.1.4-.2s0-.3-.1-.4L6.7 9.7c-.7-.5-1-1.2-1-2C7.1 9 8.7 9.6 9.9 10c.7.2 1.3.3 1.8.3h.8c.1 0 .2 0 .3-.1.1-.1.1-.2.1-.3 0-.4-.1-.6-.1-.7V9c-.1-.3-.1-.5-.1-.7 0-.5.2-.8.4-1.1.2-.3.4-.5.6-.6.4-.2.9-.4 1.4-.4.6 0 1.2.2 1.7.6.2.2.6.3.9.3h.3l-.2.6V8c0 .1.1.1.2.1-.4.5-.6 1.1-.6 1.7l-.1.4z">
                                                </path>
                                            </g>
                                        </use>
                                    </svg> </span>
                                <span class="text">تویتتر</span></a>
                        </li>
                        <li class="social whats">
                            <a href="#"
                                title="واتس‌اپ" target="_blank"><span class="circle">
                                    <svg class="icon icon-whatsapp" viewBox="0 0 90 90" 0="" 90=""
                                        90""="">
                                        <use xlink:href="#si_whatsapp">
                                            <path
                                                d="M90 43.841c0 24.213-19.779 43.841-44.182 43.841a44.256 44.256 0 0 1-21.357-5.455L0 90l7.975-23.522a43.38 43.38 0 0 1-6.34-22.637C1.635 19.628 21.416 0 45.818 0 70.223 0 90 19.628 90 43.841zM45.818 6.982c-20.484 0-37.146 16.535-37.146 36.859 0 8.065 2.629 15.534 7.076 21.61L11.107 79.14l14.275-4.537A37.122 37.122 0 0 0 45.819 80.7c20.481 0 37.146-16.533 37.146-36.857S66.301 6.982 45.818 6.982zm22.311 46.956c-.273-.447-.994-.717-2.076-1.254-1.084-.537-6.41-3.138-7.4-3.495-.993-.358-1.717-.538-2.438.537-.721 1.076-2.797 3.495-3.43 4.212-.632.719-1.263.809-2.347.271-1.082-.537-4.571-1.673-8.708-5.333-3.219-2.848-5.393-6.364-6.025-7.441-.631-1.075-.066-1.656.475-2.191.488-.482 1.084-1.255 1.625-1.882.543-.628.723-1.075 1.082-1.793.363-.717.182-1.344-.09-1.883-.27-.537-2.438-5.825-3.34-7.977-.902-2.15-1.803-1.792-2.436-1.792-.631 0-1.354-.09-2.076-.09s-1.896.269-2.889 1.344c-.992 1.076-3.789 3.676-3.789 8.963 0 5.288 3.879 10.397 4.422 11.113.541.716 7.49 11.92 18.5 16.223C58.2 65.771 58.2 64.336 60.186 64.156c1.984-.179 6.406-2.599 7.312-5.107.9-2.512.9-4.663.631-5.111z"
                                                id="si_whatsapp" data-viewBox="0 0 90 90"></path>
                                        </use>
                                    </svg> </span>
                                <span class="text">واتس‌اپ</span></a>
                        </li>
                        <li class="social tel">
                            <a href="#"
                                title="تلگرام" target="_blank"><span class="circle">
                                    <svg class="icon icon-telegram" viewBox="0 0 24 24" 0="" 24=""
                                        24""="">
                                        <use xlink:href="#si_telegram">
                                            <g id="si_telegram" data-viewBox="0 0 24 24">
                                                <path
                                                    d="M21.3 4.6c0-.2-.1-.4-.2-.6-.2-.2-.4-.3-.6-.3h-.1l-.4.1-16.7 6.6c-.4.1-.6.5-.6.9s.2.8.6.9l4.2 1.6.9 5.4c.1.3.3.6.6.7.1 0 .2.1.3.1.2 0 .4-.1.6-.2l2.6-2.6 4.4 3c.2.1.4.2.5.2.1 0 .3 0 .4-.1.3-.1.5-.4.6-.7l2.8-14.7v-.1l.1-.2zm-8.2 10.6l-1.4-.9 7.1-6.8-2 10.3-3.7-2.6zm-3.8-2.4c-.1-.3-.3-.5-.6-.7l-2.4-.9L16 7.3l-6.5 6.3-.2-.8zm2.2 3.4l-1.6 1.5-.4-3.1 2 1.6zM17.9 20.2zM9.3 12.8z">
                                                </path>
                                            </g>
                                        </use>
                                    </svg> </span>
                                <span class="text">تلگرام</span></a>
                        </li>
                        <li class="social link">
                            <a href="#"
                                title="لینکداین" target="_blank"><span class="circle">
                                    <svg class="icon icon-linkedin" viewBox="0 0 32 32" 0="" 32=""
                                        32""="">
                                        <use xlink:href="#si_linkedin">
                                            <g id="si_linkedin" data-viewBox="0 0 32 32">
                                                <path
                                                    d="M73.6 10.1c-1.6 0-3 .4-4.3 1.3 0 0-.2.1-.5.3-.4.3-.7.6-1 1-1 1.2-1.5 2.6-1.6 4.1-.2 2.3-1.1 4-2.8 5 .8-.9 1-1.7.6-2.2-1.6.8-3.1.7-4.6-.4-.9-.7-1.5-1.7-1.6-2.9-.2-1.2.1-2.2.9-3.1.7-.9 1.7-1.5 2.9-1.6 1.2-.2 2.2.1 3.1.9.8.6 1.3 1.3 1.5 2.3.5-1.6 1.4-2.8 2.8-3.7-.6-.8-1.1-1.3-1.7-1.8-1.9-1.5-4-2-6.3-1.7-2.3.3-4.3 1.4-5.7 3.2s-2 4-1.7 6.4c.3 2.3 1.4 4.3 3.3 5.7 1.7 1.3 3.6 1.9 5.8 1.8 2.1-.1 3.9-.9 5.5-2.4.3-.3.5-.6.8-.9.9-1.2 1.5-2.5 1.7-3.9 0-.2 0-.4.1-.6.4-2 1.3-3.5 2.7-4.4-.7.9-.9 1.6-.6 2.2.9-.3 1.8-.1 2.5.5.6.5 1 1.1 1.1 1.9.1.8-.1 1.5-.6 2.1-.5.6-1.1 1-1.9 1.1-.8.1-1.5-.1-2.1-.6-.5-.3-.8-.8-1-1.4-.3 1.2-.8 2.3-1.6 3.2-.3.3-.5.6-.9 1 .2.2.5.4.7.6 1.6 1.2 3.4 1.7 5.4 1.5 2-.3 3.6-1.2 4.8-2.7 1.2-1.6 1.7-3.4 1.5-5.4-.3-2-1.2-3.6-2.7-4.8-1.4-1.1-2.8-1.6-4.5-1.6zM117.3 16.3c0 2.5-.5 4.7-1.6 6.6s-2.5 3.4-4.4 4.5-4.1 1.7-6.6 1.6c-1.8 0-3.5-.3-5.1-1s-3-1.6-4.2-2.8c-1.2-1.2-2.1-2.6-2.8-4.2-.7-1.6-1-3.3-1-5.1s.3-3.5 1-5.1c.7-1.6 1.6-3 2.8-4.2s2.6-2.1 4.2-2.8 3.3-1 5.1-1c3.4 0 6.3 1.1 8.8 3.4L110 9.8c-1.4-1.3-3.1-2-5.2-2-1.5 0-2.8.4-4.1 1.1s-2.2 1.7-2.9 3-1.1 2.7-1.1 4.2.4 2.9 1.1 4.2c.7 1.3 1.7 2.3 2.9 3 1.2.7 2.6 1.1 4.1 1.1 1 0 1.9-.1 2.7-.4.8-.3 1.5-.6 2-1s1-.9 1.4-1.4c.4-.5.7-1 .9-1.5.2-.5.3-.9.4-1.3h-7.4v-4.5h12.4c.1.6.1 1.3.1 2zM179.3 6c-.6 1.6-1.9 5.2-3.9 10.8-1.6 4.5-2.8 8.1-3.8 10.9-.2.5-.5 1-.9 1.3-.5.3-1 .4-1.5.3-.7-.2-1.4-.9-2-2l-3.7-7.5c-.2-.5-.6-.9-1.2-1.2-.7-.3-1.9-.9-3.7-1.8-1.5-.8-2.7-1.4-3.6-1.7-1.3-.7-1.9-1.5-2-2.4-.1-.5.1-.9.3-1.3.3-.4.7-.7 1.1-.8l8.9-3.1c3.7-1.3 6.7-2.3 8.8-3.1l2.4-.8c1-.3 1.8-.6 2.4-.7.9-.2 1.6 0 2.1.6.7.5.7 1.4.3 2.5zM219.3 7.6c-.8 1.1-1.7 2.1-2.8 2.9v.7c0 1.5-.2 3-.7 4.5-.4 1.5-1.1 2.9-2 4.3-.9 1.4-2 2.6-3.2 3.6-1.2 1-2.7 1.9-4.5 2.5-1.7.7-3.6 1-5.6.9-3.1 0-6-.8-8.6-2.5.4 0 .8.1 1.3.1 2.6 0 4.9-.8 6.9-2.4-1.2 0-2.3-.4-3.3-1.1-1-.7-1.6-1.6-2-2.8.4.1.7.1 1.1.1.5 0 1-.1 1.5-.2-1.3-.3-2.4-.9-3.2-1.9s-1.3-2.2-1.3-3.6v-.1c.8.4 1.6.7 2.5.7-.8-.5-1.4-1.2-1.8-2s-.7-1.7-.7-2.7c0-1 .3-2 .8-2.8 1.4 1.7 3.1 3.1 5.1 4.1s4.1 1.6 6.5 1.7c-.1-.4-.2-.9-.2-1.3 0-1.6.5-2.9 1.6-3.9 1.1-1.1 2.4-1.6 3.9-1.6 1.6 0 3 .6 4.1 1.8 1.3-.2 2.5-.7 3.6-1.4-.4 1.3-1.3 2.4-2.5 3.1 1.4 0 2.4-.3 3.5-.7zM9 6.1c0 .8-.3 1.4-.8 1.9s-1.3.8-2.2.8c-.8 0-1.5-.2-2-.8s-.8-1.1-.8-1.9c0-.8.3-1.5.8-2s1.2-.8 2.1-.8 1.6.3 2.1.8.7 1.2.8 2zM3.3 28.6V11h5.5v17.6H3.3zm8.8-11.9c0-1.6 0-3.5-.1-5.6h4.7l.3 2.5h.1c1.1-1.9 2.9-2.9 5.4-2.9 1.9 0 3.4.6 4.6 1.9 1.2 1.3 1.7 3.2 1.7 5.7v10.4h-5.5v-9.8c0-2.5-.9-3.8-2.8-3.8-1.3 0-2.3.7-2.8 2.1-.1.2-.2.7-.2 1.4v10.2H12c.1-.2.1-12.1.1-12.1zM143.5 2.2v4.4h-2.6c-1 0-1.6.2-2 .6s-.5 1-.5 1.8v3.2h4.9l-.7 5h-4.3V30h-5.1V17.2H129v-5h4.3V8.6c0-2.1.6-3.7 1.7-4.8s2.7-1.7 4.7-1.7c1.6-.1 2.9 0 3.8.1z">
                                                </path>
                                            </g>
                                        </use>
                                    </svg> </span>
                                <span class="text">لینکداین</span></a>
                        </li>
                    </ul>
                    <div class="form-field mt-lg">
                        <div class="field-inner">
                            <div class="input-copy w-100">
                                <div class="input-text form-input">
                                    <div class="input-inner">

                                        <input class="input ltr input-disabled" type=""
                                            id="shareUrl" value="" name="link" placeholder=""
                                            autocomplete="off" disabled="true" readonly="">

                                        <div class="input-box"></div>
                                      
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>

                <script>
                   $('#shareUrl').val(window.location.href);
                    $('.social.face a').attr('href','http://www.facebook.com/share.php?u='+window.location.href+'')
                    $('.social.whats a').attr('href','https://wa.me/?text='+window.location.href+'')
                    $('.social.twit a').attr('href','https://www.twitter.com/intent/tweet?url='+window.location.href+'')
                    $('.social.tel a').attr('href','https://t.me/share/url?url='+window.location.href+'')
                    $('.social.link a').attr('href','https://www.linkedin.com/shareArticle?mini=true&amp;url='+window.location.href+'')
            
                </script>

            </div>
        </div>
    </div>
</div>








<div id="popup1" class="overlay1">
    <div class="popup">
        <a class="close" href="#">&times;</a>
        <div class="content">
            <form id="" action="{{route('AddComment')}}" method="post">
                @csrf
                <div class="mt-3">
                    <h5 class="modal-title px-3 pt-1 mb-2" id="exampleModalLabel"> افزودن دیدگاه
                    </h5>
                    <div class="form-group col-md-12">
                        <input type="hidden" id="parent_id" name="parent_id" value="0">
                        <input type="hidden" name="post_id" value="{{$content->id}}">
                        <textarea type="text" rows="4" class="form-control" name="comment"
                            id="comment"></textarea>
                    </div>
                </div>
                <div class="form-group col-md-12">
                    <button type="submit" class="btn btn-sm btn-primary">ارسال </button>
                </div>
            </form>
        </div>
    </div>
</div>
<div id="popup1" class="overlay report">
    <div class="popup">
        <a class="close" href="#">&times;</a>
        <div class="content">
            <form id="" action="{{route('Post.Report')}}" method="post">
                @csrf
                <div class="mt-3">
                    <h5 class="modal-title px-3 pt-1 mb-2" id="exampleModalLabel"> ارسال گزارش تخلف
                    </h5>
                    <div class="form-group col-md-12">
                        <input type="hidden" id="parent_id" name="parent_id" value="0">
                        <input type="hidden" name="postid" value="{{$content->id}}">

                        <textarea type="text" placeholder="توضیح " rows="4" class="form-control"
                            name="info" id="description"></textarea>
                    </div>
                </div>
                <div class="form-group col-md-12">
                    <button type="submit" class="btn btn-sm btn-primary">ارسال </button>
                </div>
            </form>
        </div>
    </div>
</div>

